#Дан список чисел. Определите, сколько в нем встречается различных чисел.

a = set(input().split())
print(len(a))